{
    "movieList" : [
       {
            "id":1,
            "url":"https://www.91-cdn.com/metareel-images/content/posters-7-1683636514995-BkRDHNm3uFZqO70Hjuemud122V.jpg?tr=h-350,q-40&version=5",
            "title":"Jailer",
             "thumbnail":"https://wallpaperaccess.com/full/9041063.jpg",
            "imdb":"IMDb 8",
            "plot":"Muthuvel Pandian is a retired police officer who lives in Kodambakkam with his family. Muthuvel's son ACP Arjun is investigating Varman, an eccentric gangster operating from his base of operations in Arakkonam, who smuggles idols of gods and sells them to buyers overseas. Arjun confronts Varman's henchman Seenu and demands him about the whereabouts of Varman. While getting closer in nabbing Varman, Arjun suddenly goes missing and the police department covers up his murder by spreading word that he may have committed suicide due to the stress in the job.Grieving the loss of his son and partly blaming himself for raising him to be honest and fearless, Muthuvel goes after Seenu and murders him, where he disposes the body by coercing a local taxi driver Vimal into helping him. Varman’s men attempt to kill Muthuvel's grandson Rithvik, but Muthuvel manages to save him. Muthuvel tries to convince Varman to leave him and his family alone, but to no avail. Enraged, Muthuvel decides to fight back, where he blackmails a psychiatrist S. Dhandapani into providing asylum for his family. Muthuvel then visits Narasimha, a reformed criminal living in Mandya, who loans him four of his sharpest shooters",

            "cast":"Rajinikanth,Vinayakan, Ramya Krishnan, Vasanth Ravi",
            "dir" : "Nelson Dilipkumar"
           
        },
        {
            "id":2,
            "url":"https://www.91-cdn.com/metareel-images/content/posters-7-1686510670696-lZ2BbjGBDRW5Q5Q9jgEknuiEQ0f.jpg?tr=h-350,q-40&version=5",
            "title":"Por Thozil",
            "imdb":"IMDb 8",
            "plot":"Prakash is a newly appointed DSP trainee, who is assigned to work with SP Loganathan by ADGP Mahendran. Loganathan reluctantly agrees to mentor him, along with the new technical assistant Veena. From Chennai, the trio set off to Trichy to investigate the gruesome murder of a young girl in deep woods. The doctor concludes that the victim was strangulated from the front with an iron wire, when she was in a kneeling position with her hair pulled back and that the deep knife-like cut by the wire must have been caused by the strength of an oversized man. A hematoma on her neck reveals that the victim was knocked at specific pressure points on her sternocleidomastoid muscle to make her unconscious, following which she was kidnapped. The peculiarity of the case makes Loganathan anticipate a series of murders.As predicted, a few more young women are killed in the same manner and their corpses are left in the woods with one of whom being the daughter of a police constable. None of the victims had any connection or similarity except their ages (early-mid 20s) and the fact that they were killed in the same manner and abandoned in a secluded region within the radius of 4-5 km from their house. Over the course of their investigation together, Prakash and Loganathan begin to bond after initially being at loggerheads as each recognizes the other's dedication to solving the murders. Prakash also starts liking the way Loganathan handles the case. Later, Loganathan infers from the modus operandi and the killer's choice of random women, that he must be a psychopath with inferiority complex, who compensates his low self-esteem by putting his victims in a submissive position with their eyes gazing right into his eyes, and murders them to vent out his pent-up anger on someone else.",
            "cast" :"R. Sarathkumar ,Ashok Selvan ,Nikhila Vimal",
            "dir" :"Vignesh Raja"
        },
        
        {
            "id":3,
            "url":"https://www.91-cdn.com/metareel-images/content/posters-7-1692125620545-eTLmwObjtcZhR114TOrgb22N8CC.jpg?tr=h-350,q-40&version=5",
            "title":"Maaveeran",
            "imdb":"IMDb 7.4",
            "plot":"Sathya is a comic book artist who writes and illustrates a comic strip about a brave warrior named Maaveeran for the Tamil newspaper Dhina Thee. However he is also a coward who is unable to stand up for himself, ever since his father was killed several years ago in his fight against the existing system. He allows an employee at Dhina Thee to take credit for Maaveeran due to his cowardice. Nila, a sub-editor at the paper, takes a stand on Sathya's behalf, securing him the same job that he was being exploited. Eventually, both become good friends.Sathya and his family, comprising his widowed mother, Eshwari, and younger sister, Raji, along with his neighbours, are forced to move out of their slum and relocate to a high-rise apartment built by the Government of Tamil Nadu to improve their living conditions. But within a few hours of moving in, the apartment's flaws get exposed as a result of shoddy construction, crumbling walls due to unstable foundation, broken doors, poorly installed windows, and the ceiling falling apart. Eshwari confronts the contractor, Dhanraj, as well as the local councillor Paguthi, refusing to accept the uninhabitable conditions, but Sathya implores his mother to adjust to the conditions, instead showing his frustration via Maaveeran comic strips. Eventually, when Raji is sexually harassed by Dhanraj and Sathya is unable to do anything about it, a livid Eshwari vents out her frustration on Sathya and his cowardice, and throws away all of his Maaveeran strips as well as his drawing material.",
            "cast" : "Sivakarthikeyan ,Aditi Shankar ,Saritha,Mysskin",
            "dir":"Madonne Ashwin"
        },
        {
            "id":4,
            "url":"https://www.91-cdn.com/metareel-images/content/posters-7-1691041743148-aautnOfweBUF74nmwRI2iSf8VdL.jpg?tr=h-350,q-40&version=5",
            "title":"Dd Returns",
            "imdb":"IMDb 6.3",
            "cast" :"Santhanam,Surbhi",
            "plot" :"DD Returns is a horror comedy drama that revolves around the Fernandes family, who are haunted by ghosts. When a gang of thieves steals crores of rupees and needs a place to hide, they unwittingly enter the Fernandes' home. The ghosts, who have been waiting for someone to play with, are eager to get to workThe thieves entered the house through the only entrance, but they could only leave if they found the one door that would allow them to escape. If they don't find the door, they will be trapped inside the house forever, or worse, killed by the ghosts.But Santhanam and his crew are not afraid of ghosts, and they can find the door and escape the house, no matter what the ghosts throw at them. The climax of the film was a foregone conclusion, but the journey to get there was the real story. The way the characters encountered the ghosts, the comic timing of Santhanam, and the crew's handling of the supernatural elements were all essential to the film's anticipation",
            "dir":"Prem Anand S"
        },
        {
            "id":5,
            "url":"https://www.91-cdn.com/metareel-images/content/posters-7-1687217974775-x7C2u4oXoMFQBaSJqqcyU3qpwKy.jpg?tr=h-350,q-40&version=5",
            "title":"Dada",
            "imdb":"IMDb 8.2",
            "cast":"Kavin Raj, Aparna Das, Harish Kumar",
            "plot":"Manikandan and Sindhu are final-year college students and are in a relationship. However, Sindhu becomes pregnant, and their lives change. Mani asks Sindhu for an abortion, but she refuses and they both rent a house. Due to Mani's drinking problem, he mistreats Sindhu by not paying attention to her and not caring about her. After Sindhu gives birth, Mani reaches the hospital to see Sindhu missing and leaving the baby behind. It came to his attention that she had run away somewhere far. Thus, caring for the baby, Mani names his child Aditya and raises him to be a gentleman.After a few years, Mani searches for a new job, where he finally lands a job and meets Sindhu in the same company. Knowing that she is the manager of the company, he was very scared to work at the office at first but later starts to feel good about going to the office. One day, Mani brings Aditya to his office. When Sindhu meets Aditya, he tells her that Mani is his father, which meant that Aditya was her son. After realizing this, Sindhu converses with Mani. When Mani asks Sindhu about leaving the baby despite his insistences for an abortion, Sindhu reveals that her parents had lied that the baby had died and she thought it was due to Mani's irresponsible behavior and left him. After clearing the misunderstanding, Aditya, Sindhu, and Mani reunite as a family.",
            "dir":"Ganesh K. Babu"

        },
        {
            "id":6,
            "url":"https://www.91-cdn.com/metareel-images/content/posters-1692258863-fIwLD6e0BsoVFMS8aKoPYTlwEEp.jpg?tr=h-350,q-40&version=5",
            "title":"Harkara",
            "imdb":"IMDb 8",
            "cast":"Ganesh K. Babu",
            "plot":"Helmed and performed by Ram Arun Castro, Harkara is the story of two postmen from two different timelines. In the present, Postman Kaali (Kaali Venkat), is assigned duty in the obscure foothill of Keezh Malai, but he wishes to get a transfer from the underdeveloped tribal village. Does he change his mind after listening to the story of first postman Madheshwaran/Harkara (Ram Arun Castro)? tells the rest of the film.Ram's staging is brilliant, as we get hooked on to the conflicts faced by Kaali within the first 20 minutes. For instance, the film begins with a scene where a woman from the village wakes Kaali up, in the dead of night for her savings money, effectively highlighting how naive and atypical the local people are.As we get hooked on to the narrative, Kaali starts climbing uphill to deliver a letter to Mariyammal, who has been awaiting it for years. ",
            "dir":"Ram Arun Castro"
        },
        {
            "id":7,
            "url":"https://www.91-cdn.com/metareel-images/content/posters-7-1693446127116-kynXOnVNi5s1BgLNILii00RJdaW.jpg?tr=h-350,q-40&version=5",
            "title":"Adiyae",
            "imdb":"IMDb 6.3",
            "cast":"G. V. Prakash Kumar, Gouri G Kishan",
            "plot":"Jeeva is in love with Senthazhini since school days. Years later, Senthazhini is a renowned singer while Jeeva is ordinary common man who is still in love with Senthazhini but has not disclosed yet.One day he gets transported to an alternate universe, where he is an accomplished musician and Senthazhini is his wife!His trip to the parallel universe reverts back after a predetermined period.Jeeva goes back to the parallel universe to be with Senthazhini, eventually comes back to the 'reality'. How Jeeva resolves his love story in reality forms the rest of the story.",
            "dir":"Vignesh Karthick"
            
        },
        {
            "id":8,
            "url":"https://www.91-cdn.com/metareel-images/content/posters-1683695215-aFTO0tCTxXazstWfhOQHPb3kcMT.jpg?tr=h-350,q-40&version=5",
            "title":"Good Night",
            "imdb":"IMDb 7.7",
            "cast":"Raaj Vishwakarma, K. Manikandan",
            "plot":"Mohan is from an average middle-class family. He lost his father to alcohol and has an elder and a younger sister. Against their family's wishes, his older sister married his friend, who works at a water filter company. Despite supporting their marriage, Mohan faces challenges in his own life. He works in an IT company and constantly clashes with his boss due to his limited English fluency and an earlier situation where Mohan placed a complaint on the boss for sending emails to female colleagues. Additionally, his snoring problem causes him to be looked down upon by his colleagues, earning him the nickname On the other side, we have Anu, an orphan living upstairs in a house owned by an elderly couple who act as her grandparents. Mohan accompanies his brother-in-law to the couple's house for water filter maintenance and meets Anu. They develop an interest in each other and start dating. Anu considers herself unlucky due to the early death of her parents and several incidents, but Mohan reassures her and they begin a new life together. However, Mohan's snoring becomes a concern for him, fearing its impact on their marriage. Anu promises him that it's not a problem.",
            "dir":"Vinayak Chandrasekaran"
        },
        {
            "id":9,
            "url":"https://www.91-cdn.com/metareel-images/content/posters-7-1687880432896-bdfmTnEyGDN46o6q1gUxuNdoQv8.jpg?tr=h-350,q-40&version=5",
            "title":"Maayon",
            "imdb":"IMDb 6.9",
            "plot":"The gang of sophisticated idol smugglers, driven by their insatiable greed, finalises their precise plan to steal the hidden riches nestled within the old Hindu temple in the middle of the night, beneath the shroud of darkness.we have Anu, an orphan living upstairs in a house owned by an elderly couple who act as her grandparents. Mohan accompanies his brother-in-law to the couple's house for water filter maintenance and meets Anu. They develop an interest in each other and start dating. Anu considers herself unlucky due to the early death of her parents and several incidents, but Mohan reassures her and they begin a new life together. However, Mohan's snoring becomes a concern for him, fearing its impact on their marriage. Anu promises him that it's not a problem.",
            "cast":"Sibiraj,Tanya Ravichandran, Radha Ravi,",
            "dir":"N. Kishore"
        }
               
    ]
}